# coding: utf-8

# NOTE: This file is AUTO GENERATE by excel export script, please NOT MODIFIED
#       file data manually.
# ------------------------------------------------------------------
# Copyright QianHui.INC 2023-2023
# ------------------------------------------------------------------
# SHEET NAME: gacha/gachaInfo
import gamedatatools as _tools
# useful import
import collections
import random
import math
import re
import crontab

datas = _tools.RODict({ 
    10102: _tools.RODict({
        "ID": 10102,
        "title": "<color=#a677c6>史诗品质精灵</color><color=#9e9886>召唤获得概率0.1%</color>",
        "petList": (15000021, 15000022, 15000023, 15000024, 15000025, 15000026, 15000027, 15000028, 15000044, 15000045, 15000046, 15000047)
    }),
    10103: _tools.RODict({
        "ID": 10103,
        "title": "<color=#739cc9>精良品质精灵</color><color=#9e9886>召唤获得概率6%</color>",
        "petList": (15000011, 15000012, 15000013, 15000014, 15000015, 15000016, 15000017, 15000018, 15000019, 15000020, 15000039, 15000040, 15000041, 15000042, 15000043)
    }),
    10104: _tools.RODict({
        "ID": 10104,
        "title": "<color=#65b276>优秀品质精灵</color><color=#9e9886>召唤获得概率93.9%</color>",
        "petList": (15000001, 15000002, 15000003, 15000004, 15000005, 15000006, 15000007, 15000008, 15000009, 15000010, 15000034, 15000035, 15000036, 15000037, 15000038)
    }),
    10201: _tools.RODict({
        "ID": 10201,
        "title": "<color=#739cc9>精良品质精灵</color><color=#9e9886>召唤获得概率2%</color>",
        "petList": (15000011, 15000012, 15000013, 15000014, 15000015, 15000016, 15000017, 15000018, 15000019, 15000020, 15000039, 15000040, 15000041, 15000042, 15000043)
    }),
    10202: _tools.RODict({
        "ID": 10202,
        "title": "<color=#65b276>优秀品质精灵</color><color=#9e9886>召唤获得概率98%</color>",
        "petList": (15000001, 15000002, 15000003, 15000004, 15000005, 15000006, 15000007, 15000008, 15000009, 15000010, 15000034, 15000035, 15000036, 15000037, 15000038)
    })
})
minKey = 10102
maxKey = 10202